#include "stm32f10x.h"                  // Device header
#include <stdio.h>

int main()
{
/*
	一、已知变量`a`的值为十六进制`0x5A`，请使用按位与操作`&`，将其与十六进制`0x0F`进行按位与运算，计算并输出结果。
*/	
	int a = 0x5A;
	printf("输出结果为%d \n",a & 0x0F);
	
/*
	二、给定变量`b`的值为十六进制`0x3C`，使用按位或操作符`|`将其与十六进制`0x07`进行按位或运算，计算并输出结果。
*/		
	int b = 0x3C;
	printf("输出结果为%d \n",b | 0x07);
	
/*
	三、已知变量`c`的值为十六进制`0xFF`，使用按位取反操作符`~`，对其进行按位取反操作，输出结果。
*/		
	int c = 0xFF;
	printf("输出结果为%d \n",~c);
	
/*
	四、将变量`d`的值左移2位。假设`d = 0x15`，输出左移后的值。
*/		
	int d = 0x15;
	printf("输出结果为%d \n",d<<2);	
		
/*
	五、将变量`e`的值右移3位，假设`e = 0x98`，输出右移后的值。
*/		
	int e = 0x98;
	printf("输出结果为%d \n",d>>2);	
	
/*
	六、给定一个8位的无符号整数`f = 0b11001010`，请计算以下操作：

1. 将`f`的最低有效位清零（即按位与`0b11111110`）。
2. 将`f`的第三位（从右数）置为1（即按位或`0b00000100`）。

*/		
	int f = 0b11001010;
	printf("输出结果为%d \n",f & 0b11111110);	
	printf("输出结果为%d \n",f | 0b00000100);	
	
/*
	七、在给定的整数`g = 0x2A`中，清除其第4位（从右数，按位与`0b11101111`），并在第5位设置1（按位或`0b00100000`），输出最后的结果。
*/		
	int g = 0x2A;
	printf("输出结果为%d \n",g & 0b11101111);	
	printf("输出结果为%d \n",g | 0b00100000);	
}