/***************************************************
# File Name:    03-逻辑运算符.c
# Author:       SuperYu
# Mail:         yujian001002@163.com.com
# Created Time: Wed 19 Feb 2025 06:33:57 PM PST
****************************************************/

#include <stdio.h>
#include <stdbool.h>
 
int main(int argc, char *argv[]) {
	int a = 3;              // 0011
	// 00000000 00000000 00000000 00001011
	// 11111111 11111111 11111111 11110100
	int b = 11;             // 1011
	
	// & 运算：  1,1 为 1
	printf("&运算的结果：%d \n", a & b);
	
	// | 运算：  有1 为 1
	printf("|运算的结果：%d \n", a | b);

	// ^ 运算：  相同为0，不同为1
	printf("^运算的结果：%d \n", a ^ b);

	// ~ 运算：
	printf("~运算的结果：%d \n", ~b);

	puts("----------------------------------");

	int num = 8;
	
	printf("左移后的结果：%d \n", num << 2 );
	printf("右移后的结果：%d \n", num >> 1 );


	puts("-----------------------------------");
	// 三目运算：
	// 可以简单的理解为是一个分支语句：
	int x = 100;
	int y = 10;
	
	char f = x < 10 ? 'F': 'T';
	
	printf("结果是：%c \n", f);	

    return 0;
}








